---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealWarn
source: html/23ac4258-008e-a2bd-308e-51e656591926.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotCreateRevealWarn Property

Could not create Reveal. [Description]

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotCreateRevealWarn { get; }
```